{
    "help_param": "Ayuda:\n\n    ReLU Script - Una interfaz de línea de comandos para interactuar con un modelo de IA generativa.\n    Este asistente consume la API de Gemini impulsada por Google, lo que permite ser un gran ayudante desde la terminal.\n    Puedes borrar el historial de conversación, ver información sobre la última conversación y más.\n\n  Opciones:\n    --clear, -c        Limpiar la memoria de ReLU para entablar una nueva conversación con ReLU\n    --remember, -r     Muestra la cantidad de tokens, mensajes y 2 ultimos mensajes enviados.\n    --key              Establecer la clave API para la autenticación (https://ai.google.dev/)\n    --name             Establecer tu nombre para ReLU.\n    --help, -h         Mostrar este mensaje de ayuda\n    --lang             Establecer un idioma para el prompt de ReLU y el sistema (2 letras)\n\n  Ejemplos:\n    relu --clear\n    relu --remember\n    relu --name Jon\n    relu --help\n    relu --key TU_CLAVE_API\n    relu dame un comando aleatorio de linux\n    relu --lang es\n",
    "error_act": "Ocurrió un error",
    "error_desc_clear": "Ocurrió un error al intentar limpiar la memoria de ReLU: {}.",
    "success_act": "Acción realizada",
    "success_desc_clear": "La memoria de ReLU ahora está limpia.",
    "empty_chat": "La conversación con ReLU está vacía.",
    "in_process": "Generando texto...",
    "help_api_key": "No has establecido alguna KEY para comunicarse con la API de Google!, visita https://ai.google.dev/ y obten tu key!\n\nLuego usa: relu --key TU_API_KEY",
    "param_unrecognized": "El parámetro {} no fué reconocido.",
    "success_save_apikey": "La KEY fue guardada satisfactoriamente.",
    "key_not_found": "Key no encontrada.",
    "success_save_lang": "El idioma fué establecido.",
    "lang_not_found": "Lenguaje no encontrado.",
    "apikey_invalid": "La API KEY establecida no es válida.",
    "prompt_relu": "Eres un asistente virtual llamado ReLU muy útil y rápido, que responde de la manera más corta y directa posible cuando alguien le está pidiendo algo.\n- Si alguien te pide algo, y no tienes mucha información disponible, hazlo igualmente, improvisando y crea EJEMPLOS.\n- Si alguien tiene un problema, ayúdale y explícale paso a paso la solución lo más que puedas, por lo que te recomiendo ser lo más específico posible\n- Usa los datos que tengas.\n- Si alguien simplemente quiere charlar contigo, tienes que ser amigable y curioso, y no es necesario hablar de manera directa (SOLO en ese caso, en los otros casos si tienes que serlo).\n- Te estás comunicando a través de la misma terminal del usuario.\n\nAcá tienes información del sistema operativo donde estás hablando ahora mismo:\n\n{}\n\nNUNCA DIGAS QUE NO PUEDES HACER ALGO, SI ES MUY COMPLICADO, TIENES QUE INTENTARLO IGUALMENTE.\nSi el usuario necesita que muestres un ejemplo o programes algo, hazlo, y si no te especificó en qué lenguaje de programación lo hagas, entonces hazlo en python SIEMPRE Y CUANDO SE PUEDA\nSolo tienes una oportunidad para responder al usuario, por lo que, tienes que usar esa oportunidad para responder lo mejor que puedas, si te pidió algo ambiguo, hazlo bajo lo standard o normal que se haría.\n\n-------",
    "name_not_found": "Nombre no encontrado.",
    "success_save_name": "Tu nombre fué guardado para ReLU."    
}